{"keras_version": "2.2.0", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "ResNet50", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "name": "input_1"}, "inbound_nodes": []}, {"name": "zero_padding2d_1", "class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_1", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 64, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [7, 7], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"name": "bn_conv1", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn_conv1", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "inbound_nodes": [[["bn_conv1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "padding": "valid", "pool_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "res2a_branch2a", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 64, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res2a_branch2a", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "bn2a_branch2a", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn2a_branch2a", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]]}, {"name": "res2a_branch2b", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 64, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res2a_branch2b", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "bn2a_branch2b", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn2a_branch2b", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]]}, {"name": "res2a_branch2c", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 256, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res2a_branch2c", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "res2a_branch1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 256, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res2a_branch1", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "bn2a_branch2c", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn2a_branch2c", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]]}, {"name": "bn2a_branch1", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn2a_branch1", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "res2b_branch2a", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 64, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res2b_branch2a", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "bn2b_branch2a", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn2b_branch2a", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]]}, {"name": "res2b_branch2b", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 64, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res2b_branch2b", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "bn2b_branch2b", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn2b_branch2b", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]]}, {"name": "res2b_branch2c", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 256, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res2b_branch2c", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "bn2b_branch2c", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn2b_branch2c", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_7", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "res2c_branch2a", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 64, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res2c_branch2a", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "bn2c_branch2a", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn2c_branch2a", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}, "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]]}, {"name": "res2c_branch2b", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 64, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res2c_branch2b", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"name": "bn2c_branch2b", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn2c_branch2b", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}, "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]]}, {"name": "res2c_branch2c", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 256, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res2c_branch2c", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"name": "bn2c_branch2c", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn2c_branch2c", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_10", 0, 0, {}]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "res3a_branch2a", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 128, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3a_branch2a", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"name": "bn3a_branch2a", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn3a_branch2a", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"trainable": true, "name": "activation_14", "activation": "relu"}, "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]]}, {"name": "res3a_branch2b", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 128, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3a_branch2b", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"name": "bn3a_branch2b", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn3a_branch2b", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"trainable": true, "name": "activation_15", "activation": "relu"}, "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]]}, {"name": "res3a_branch2c", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 512, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3a_branch2c", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"name": "res3a_branch1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 512, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3a_branch1", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"name": "bn3a_branch2c", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn3a_branch2c", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]]}, {"name": "bn3a_branch1", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn3a_branch1", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"trainable": true, "name": "add_5"}, "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"trainable": true, "name": "activation_16", "activation": "relu"}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "res3b_branch2a", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 128, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3b_branch2a", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"name": "bn3b_branch2a", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn3b_branch2a", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]]}, {"name": "activation_17", "class_name": "Activation", "config": {"trainable": true, "name": "activation_17", "activation": "relu"}, "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]]}, {"name": "res3b_branch2b", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 128, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3b_branch2b", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"name": "bn3b_branch2b", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn3b_branch2b", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]]}, {"name": "activation_18", "class_name": "Activation", "config": {"trainable": true, "name": "activation_18", "activation": "relu"}, "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]]}, {"name": "res3b_branch2c", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 512, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3b_branch2c", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"name": "bn3b_branch2c", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn3b_branch2c", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"trainable": true, "name": "add_6"}, "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_16", 0, 0, {}]]]}, {"name": "activation_19", "class_name": "Activation", "config": {"trainable": true, "name": "activation_19", "activation": "relu"}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "res3c_branch2a", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 128, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3c_branch2a", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"name": "bn3c_branch2a", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn3c_branch2a", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]]}, {"name": "activation_20", "class_name": "Activation", "config": {"trainable": true, "name": "activation_20", "activation": "relu"}, "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]]}, {"name": "res3c_branch2b", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 128, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3c_branch2b", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"name": "bn3c_branch2b", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn3c_branch2b", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]]}, {"name": "activation_21", "class_name": "Activation", "config": {"trainable": true, "name": "activation_21", "activation": "relu"}, "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]]}, {"name": "res3c_branch2c", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 512, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3c_branch2c", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"name": "bn3c_branch2c", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn3c_branch2c", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"trainable": true, "name": "add_7"}, "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"name": "activation_22", "class_name": "Activation", "config": {"trainable": true, "name": "activation_22", "activation": "relu"}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "res3d_branch2a", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 128, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3d_branch2a", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"name": "bn3d_branch2a", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn3d_branch2a", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]]}, {"name": "activation_23", "class_name": "Activation", "config": {"trainable": true, "name": "activation_23", "activation": "relu"}, "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]]}, {"name": "res3d_branch2b", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 128, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3d_branch2b", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"name": "bn3d_branch2b", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn3d_branch2b", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]]}, {"name": "activation_24", "class_name": "Activation", "config": {"trainable": true, "name": "activation_24", "activation": "relu"}, "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]]}, {"name": "res3d_branch2c", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 512, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3d_branch2c", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"name": "bn3d_branch2c", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn3d_branch2c", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"trainable": true, "name": "add_8"}, "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_22", 0, 0, {}]]]}, {"name": "activation_25", "class_name": "Activation", "config": {"trainable": true, "name": "activation_25", "activation": "relu"}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "res4a_branch2a", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 256, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res4a_branch2a", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_25", 0, 0, {}]]]}, {"name": "bn4a_branch2a", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn4a_branch2a", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]]}, {"name": "activation_26", "class_name": "Activation", "config": {"trainable": true, "name": "activation_26", "activation": "relu"}, "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]]}, {"name": "res4a_branch2b", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 256, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res4a_branch2b", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_26", 0, 0, {}]]]}, {"name": "bn4a_branch2b", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn4a_branch2b", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]]}, {"name": "activation_27", "class_name": "Activation", "config": {"trainable": true, "name": "activation_27", "activation": "relu"}, "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]]}, {"name": "res4a_branch2c", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 1024, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res4a_branch2c", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_27", 0, 0, {}]]]}, {"name": "res4a_branch1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 1024, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res4a_branch1", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_25", 0, 0, {}]]]}, {"name": "bn4a_branch2c", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn4a_branch2c", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]]}, {"name": "bn4a_branch1", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn4a_branch1", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"trainable": true, "name": "add_9"}, "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]]}, {"name": "activation_28", "class_name": "Activation", "config": {"trainable": true, "name": "activation_28", "activation": "relu"}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "res4b_branch2a", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 256, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res4b_branch2a", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"name": "bn4b_branch2a", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn4b_branch2a", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]]}, {"name": "activation_29", "class_name": "Activation", "config": {"trainable": true, "name": "activation_29", "activation": "relu"}, "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]]}, {"name": "res4b_branch2b", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 256, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res4b_branch2b", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"name": "bn4b_branch2b", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn4b_branch2b", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]]}, {"name": "activation_30", "class_name": "Activation", "config": {"trainable": true, "name": "activation_30", "activation": "relu"}, "inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]]}, {"name": "res4b_branch2c", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 1024, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res4b_branch2c", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_30", 0, 0, {}]]]}, {"name": "bn4b_branch2c", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn4b_branch2c", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]]}, {"name": "add_10", "class_name": "Add", "config": {"trainable": true, "name": "add_10"}, "inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_28", 0, 0, {}]]]}, {"name": "activation_31", "class_name": "Activation", "config": {"trainable": true, "name": "activation_31", "activation": "relu"}, "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"name": "res4c_branch2a", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 256, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res4c_branch2a", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_31", 0, 0, {}]]]}, {"name": "bn4c_branch2a", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn4c_branch2a", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]]}, {"name": "activation_32", "class_name": "Activation", "config": {"trainable": true, "name": "activation_32", "activation": "relu"}, "inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]]}, {"name": "res4c_branch2b", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 256, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": 0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res4c_branch2b", "kernel_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["activation_32", 0, 0, {}]]]}, {"name": "bn4c_branch2b", "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": 3, "center": true, "name": "bn4c_branch2b", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]]}, {"name": "activation_33", "class_name": "Activation", "config": {"trainable": true, "name": "activation_33", "activation": "relu"}, "inbound_nodes": [[["bn4c_branch2b", 0, 0, {}]]]}, {"name": "res4c_branch2c", "class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "linear", "filters": 1024, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_last", 